Repository: nuclewall/bsdinstaller
Catalog: src/backend/installer/po/*.po
Languages: ru

source: %s was not fully installed.
ru: %s не была полностью установлена.

source: /home will be symlinked to /usr/home
ru: /home будет символической ссылкой на /usr/home

source: /tmp will be symlinked to /var/tmp
ru: /tmp будет символической ссылкой на /var/tmp

source: /usr will be a plain dir in /
ru: /usr будет обычным каталогом в /

source: /var will be a plain dir in /
ru: /var будет обычным каталогом в /

source: A capacity must be specified.
ru: Должен быть задан размер.

source: A failure occured while provisioning the NetBoot environment. Please check the logs.
ru: При включении NetBoot произошли ошибки. Просмотрите протокол.

source: ATA Devices
ru: Устройства ATA

source: Accept and Add
ru: Принять и добавить

source: Accept and Create
ru: Принять и создать

source: Accept and Install
ru: Принять и установить

source: Accept and Install Bootblocks
ru: Подтвердить и установить загрузочный блок

source: Accept and Remove
ru: Принять и удалить

source: Accept and Set Password
ru: Принять и установить пароль

source: Action cancelled - no disks were formatted.
ru: Действие отменено - диски не были отформатированы.

source: Action cancelled - no primary partitions were formatted.
ru: Действие прервано - нет отформатированных основных разделов.

source: Add a user
ru: Добавление пользователя

source: Add a user to the system
ru: Добавление пользователя в систему

source: Add user
ru: Добавить пользователя

source: An error occurred when setting the root password.
ru: При установке пароля root произошла ошибка

source: Assign IP Address
ru: Присвоение IP адреса

source: BIND Name Server
ru: Служба имен BIND

source: Begin Installation
ru: Начало установки

source: Begin Installing Files
ru: Начало установки файлов

source: Block Sz
ru: Размер блока

source: Boot sector successfully initialized.
ru: Загрузочный сектор успешно инициализирован.

source: Bootblock Install Failed
ru: Установка загрузочного блока прошла неудачно

source: Bootblocks were successfully installed!
ru: Загрузочные блоки были успешно установлены!

source: CDBoot floppy successfully created!
ru: Дискета CDBoot была успешно создана!

source: CDBoot floppy was not successfully created.
ru: Дискета CDBoot не была создана.

source: Cancel
ru: Отмена

source: Cancel Memory Test
ru: Выход из тестирования памяти

source: Capacity
ru: Размер

source: Capacity must be either a '*' symbol to indicate 'use the rest of the primary partition', or it must be a series of decimal digits ending with a 'M' (indicating megabytes) or a 'G' (indicating gigabytes.)
ru: Размер задается или символом '*', означающим 'использовать остаток основного раздела', или числом с последующим символом 'M' (означающим мегабайты) или 'G' (означающим гигабайты).

source: Chosen shell does not exist on the system.
ru: Выбранной оболочки нет в этой системе

source: Configure Interface
ru: Настройка интерфейса

source: Configure a %s system once it has been installed on HDD
ru: Настройка системы %s после установки на диск

source: Configure an Installed System
ru: Настройка установленной системы

source: Configure hostname and domain
ru: Настройка имени хоста и домена

source: Configure network interfaces
ru: Настройка сетевых интерфейсов

source: Configure the LiveCD Environment
ru: Настройка окружения LiveCD

source: Configure the hostname and domain for this system
ru: Настройка имени хоста и домена для системы

source: Configure this %s System
ru: Настройка системы %s

source: Configure this %s system
ru: Настройка системы %s

source: Configure this System
ru: Настройка системы

source: Configure this System|Reboot|Return to Welcome Menu
ru: Настройка системы|Перезагрузка|Возврат в главное меню

source: Configuring Interface:
ru: Настройка интерфейса:

source: Congratulations! %s has successfully been installed on this computer. You may now proceed to configure the installation. Alternately, you may wish to reboot the computer and boot into the installed system to confirm that it works.
ru: Поздравляем! %s была успешно установлена на этот компьютер. Теперь вы можете настроить установленную систему. Вы можете также перезагрузить компьютер, чтобы убедиться, что установленная система работает.

source: Couldn't install package `%s'.
ru: Не могу установить пакет `%s'.

source: Couldn't read %s%setc/rc.conf.
ru: Невозможно прочесть %s%setc/rc.conf.

source: Couldn't remove package `%s'.
ru: Не могу удалить пакет `%s'.

source: Create CDBoot Floppy
ru: Создание дискеты CDBoot

source: Create CDBoot Floppy|Return to Utilities Menu
ru: Создание дискеты CDBoot|Возврат в меню утилит

source: Create Subpartitions
ru: Создание подразделов

source: Create a CDBoot floppy
ru: Создание дискеты CDBoot

source: Create a floppy which boots into a dedicated memory-test
ru: Создание загрузочной дискеты для тестирования памяти

source: Create memtest86 Floppy
ru: Создание дискеты memtest86

source: DHCP Failure
ru: Ошибка DHCP

source: DHCP allows the interface to automatically obtain an IP address from a nearby DHCP server. Would you like to enable DHCP for this interface?
ru: DHCP позволяет автоматически получить IP адрес для интерфейса с ближайшего DHCP сервера. Включить DHCP для этого интерфейса?

source: Default Router
ru: Шлюз по умолчанию

source: Disk Drive
ru: Диск

source: Disk Utilities
ru: Дисковые утилиты

source: Disk Utilities Menu
ru: Дисковые утилиты

source: Display ATA devices
ru: Отображение устройств ATA

source: Display ATA devices (atactl)
ru: Отображение устройств ATA (atactl)

source: Display PCI devices
ru: Отображение устройств PCI

source: Display PCI devices (pciconf)
ru: Отображение устройств PCI (pciconf)

source: Display Plug'n'Play ISA devices
ru: Отображение устройств Plug'n'Play ISA

source: Display Plug'n'Play ISA devices (pnpinfo)
ru: Отображение устройств Plug'n'Play ISA (pnpinfo)

source: Display system startup messages
ru: Стартовые сообщения системы

source: Display system startup messages (dmesg)
ru: Отображение стартовых сообщений системы (dmesg)

source: Domain
ru: Домен

source: Enable NetBoot Installation Services|No thanks
ru: Включить Netboot сервисы установки|Нет, спасибо

source: Enable Netboot Installation Services?
ru: Включить Netboot сервисы установки?

source: Enable/Disable Services
ru: Включение/отключение сервисов

source: Enter a comma-separated list of other groups that this user should belong to
ru: Введите разделенный запятыми список других групп пользователя

source: Enter the Domain Name
ru: Введите имя домена

source: Enter the Domain Name (e.g. `network.lan')
ru: Введите имя домена (например, `network.lan')

source: Enter the Hostname
ru: Введите имя хоста

source: Enter the Hostname (e.g. `machine')
ru: Введите имя хоста (например, `machine')

source: Enter the IP Address you would like to use
ru: Введите IP адрес, который будет использоваться

source: Enter the IP address of primary DNS Server
ru: Введите IP адрес первичного DNS сервера

source: Enter the IP address of the default router
ru: Введите IP адрес шлюза по умолчанию

source: Enter the amount of memory you would like to check:
ru: Введите объем памяти, который необходимо протестировать:

source: Enter the current day of month (e.g. `30')
ru: Введите день (например, `30')

source: Enter the current hour (e.g. `07')
ru: Введите час (например, `07')

source: Enter the current minutes (e.g. `59')
ru: Введите минуты (например, `59')

source: Enter the current month (e.g. `07')
ru: Введите месяц (например, `07')

source: Enter the current time and date.
ru: Введите текущее время и дату.

source: Enter the current year (e.g. `2004')
ru: Введите текущий год (например, `2004')

source: Enter the full path to the user's home directory, or leave blank
ru: Введите полный путь к домашнему каталогу пользователя или оставьте поле пустым

source: Enter the full path to the user's shell program
ru: Введите полный путь к оболочке пользователя

source: Enter the netmask of the IP address
ru: Введите сетевую маску для IP адреса

source: Enter the primary group for this account, or leave blank
ru: Введите основную группу этой учетной записи или оставьте поле пустым

source: Enter the real name (or GECOS field) of this user
ru: Введите полное имя (или поле GECOS) этого пользователя

source: Enter the root password again to confirm
ru: Введите пароль root еще раз и подтвердите

source: Enter the root password you would like to use
ru: Введите пароль root

source: Enter the user's password (will not be displayed)
ru: Введите пароль пользователя (не будет отображаться)

source: Enter the username the user will log in as
ru: Введите имя пользователя

source: Enter this account's numeric user id, or leave blank
ru: Введите числовой идентификатор этой учетной записи или оставьте поле пустым

source: Enter year
ru: Введите год

source: Error Log
ru: Протокол ошибок

source: Errors occurred while probing the system for its storage capabilities.
ru: При определении объема дисков возникли ошибки.

source: Everything is now ready to install the actual files which comprise the %s operating system on the selected partition of the selected disk. Note that this process will take quite a while to finish. You may wish to take a break now and come back to the computer in a short while.
ru: Все готово к установке файлов %s на выбранный раздел выбранного диска. Этому процессу потребуется некоторое время. Вы можете сделать перерыв и вернуться к компьютеру через некоторое время.

source: Exit Installer
ru: Выход из программы

source: Exit this program and return to the system
ru: Выход из программы и возврат в систему

source: Exit this program to a login prompt with access to the LiveCD
ru: Выход из программы к приглашению командной строки LiveCD

source: Exit to Live CD
ru: Выход в Live CD

source: Filesystem table on installed system could not be read.
ru: Невозможно прочесть таблицу файловой системы на установленной системе.

source: Floppy successfully formatted!
ru: Дискета успешно отформатирована

source: Floppy was not successfully formatted.
ru: Дискета не была отформатирована.

source: Format Floppy|Return to Utilities Menu
ru: Форматирование дискеты|Возврат в меню утилит

source: Format MSDOS Floppy
ru: Форматирование дискеты MSDOS

source: Format a hard disk drive
ru: Форматирование жесткого диска

source: Format an MSDOS floppy
ru: Форматирование дискеты MSDOS

source: Format and check hard drives and floppy disks
ru: Форматирование и проверка дисков и дискет

source: Frag Sz
ru: Размер фрагмента

source: Group Memberships
ru: Принадлежность группам

source: Here you can add a user to an installed system. You can leave the Home Directory, User ID, and Login Group fields empty if you want these items to be automatically allocated by the system. Note: this user's password will appear in the install log. If this is a problem, please add the user manually after rebooting into the installed system instead.
ru: Вы можете добавить пользователя в установленную систему. Если вы оставите поля домашнего каталога, ID пользователя и группы пустыми, эти значения будут автоматически назначены системой. Внимание: пароль этого пользователя появится в протоколе установки. Если это проблема, добавьте пользователя вручную после перезагрузки установленной системы.

source: Here you can set the super-user (root) password. Note: root's new password will appear in the install log. If this is a problem, please set root's password manually after rebooting into the installed system instead.
ru: Здесь вы можете установить пароль суперпользователя (root). Внимание: пароль root появится в протоколе программы установки. Если это проблема, установите пароль root вручную после перезагрузки установленной системы.

source: Home Directory
ru: Домашний каталог

source: Hostname
ru: Имя хоста

source: How Much Disk?
ru: Какого размера диск?

source: IP Address
ru: IP адрес

source: ISA PnP Devices
ru: Устройства ISA PnP

source: If it is set to local time, or you don't know, please choose NO here!
ru: Если они установлены в локальное время, или вы не знаете, выберите NO!

source: If you are having problems formatting a disk, it may be because of junk that has accumulated in the boot block and the partition table. A cure for this is to wipe out everything on the first few sectors of the disk. However, this is a rather drastic action to take, so it is not recommended unless you are otherwise encountering problems.
ru: Если у вас возникли проблемы при форматировании диска, это могло произойти из-за содержимого загрузочного блока и таблицы разделов. Решить эти проблемы может удаление содержимого первых нескольких секторов диска. Однако, такое действие довольно серьезно и выполнять его не рекомендуется, если только оно не необходимо для решения проблем.

source: If you are having problems formatting a primary partition, it may be because of junk that has accumulated in the partition's `disklabel'. A cure for this is to wipe out everything on the first few sectors of the primary partition. However, this is a rather drastic action to take, so it is not recommended unless you are otherwise encountering problems.
ru: Если у вас возникли проблемы с форматированием раздела, это могло случиться из-за содержимого, находящегося в метке раздела. Решить эти проблемы может очистка первых нескольких секторов основного раздела. Однако, такое действие довольно серьезно и выполнять его не рекомендуется, если только оно не необходимо для решения проблем.

source: Install %s
ru: Установка %s

source: Install %s on a HDD or HDD partition on this computer
ru: Установка %s на диск или раздел диска этого компьютера

source: Install Bootblock(s)
ru: Установка загрузочных блоков

source: Install Bootblock?
ru: Установить загрузочный блок?

source: Install OS
ru: Установка OS

source: Install Packages
ru: Установка пакетов

source: Install a bootblock on this disk
ru: Установка загрузочного блока на диск

source: Install bootblocks on disks
ru: Установка загрузочного блока на диск

source: Install extra software packages
ru: Установка дополнительных программных пакетов

source: Install third-party software packages from the LiveCD
ru: Установка пакетов сторонних разработчиков с LiveCD

source: Internal error - response from frontend should be a valid device name.
ru: Внутренняя ошибка - ответ от интерфейса должен быть именем существующего устройства.

source: Internal error - response from frontend should be a valid slice number.
ru: Внутренняя ошибка - ответ от интерфейса должен быть именем существующего слайса.

source: Internet Super-Server
ru: Интернет супер-сервер

source: Is this machine's CMOS clock set to UTC?
ru: Установлены ли CMOS часы этого компьютера в UTC?

source: Keyboard map not successfully set.
ru: Раскладка клавиатуры не была установлена.

source: Live CD Diagnostics Menu
ru: Диагностическое меню Live CD

source: Live CD Environment Menu
ru: Меню переменных окружения Live CD

source: Live CD Utilities
ru: Утилиты Live CD

source: Live CD Utilities Menu
ru: Меню утилит Live CD

source: LiveCD Environment
ru: Окружение LiveCD

source: Local or UTC (Greenwich Mean Time) clock
ru: Локальные или UTC (Greenwich Mean Time) часы

source: Login Group
ru: Группа

source: Memory test
ru: Тестирование памяти

source: Memory test - Enter the size in values such as 400M, 1G.
ru: Тестирование памяти - введите размер, например 400M, 1G.

source: Memory test could not be run.
ru: Тестирование памяти не может быть запущено.

source: Memory test size
ru: Размер тестируемой памяти

source: Month
ru: Месяц

source: Mount point may not contain the following characters: blank space, backslash, or single, double, or back quotes.
ru: В точке монтирования не должно быть следующих символов: пробелов, обратной косой черты, одинарных, двойных или обратных кавычек.

source: Mount point must be either 'swap', or it must start with a '/'.
ru: Точка монтирования должна быть или 'swap' или начинаться с '/'.

source: Mountpoint
ru: Точка монтирования

source: NetBoot Installation Services allows this machine to become a Installation Server that will allow the clients to boot over the network via PXE and start the Installation Environment. *NOTE!* This will assign the IP Address of 10.1.0.1/24 to the selected interface. Would you like to provision this machine to serve up the LiveCD/Installer?
ru: NetBoot сервисы установки позволяют этому компьютеру становиться сервером установки, что позволить клиентам загрузиться через сеть посредством PXE и войти в среду установки. *ОБРАТИТЕ ВНИМАНИЕ!* Выбранному интерфейсу будет присвоен адрес 10.1.0.1/24 . Хотите ли вы включить обслуживание LiveCD/установки с этого компьютера?

source: NetBoot installation services are now started.
ru: NetBoot сервис установки был запущен.

source: Netmask
ru: Сетевая маска

source: Network Time Protocol Daemon
ru: Даемон синхронизации времени

source: Omit Subpartition(s)|Return to Create Subpartitions
ru: Пропустить подраздел(ы)|Вернуться к созданию подразделов

source: On these submenus you will find utilities to help you set up your Live CD environment, diagnose and analyse this system, and work with the devices attached to this computer.
ru: В этих меню находятся утилиты, предназначенные для настройки окружения Live CD, диагностики и анализа системы, работы с устройствами, подключенными к компьютеру.

source: On this menu you will find utilities to help you set up your Live CD environment. Note that these functions affect only the LiveCD environment you are currently using, and they will not affect any system that may be installed on this computer UNLESS you subsequently choose to install %s from this environment, in which case they will be copied to the newly installed system.
ru: В этом меню находятся утилиты для настройки переменных окружения Live CD. Эти функции работают только в той среде, где вы их используете на данный момент, и если вы устанавливаете их в среде LiveCD, а на компьютере уже установлена операционная система, для этой системы они действовать не будут, если только вы не устанавливаете %s из этой среды.

source: Other Group Memberships
ru: Другие группы

source: PCI Devices
ru: Устройства PCI

source: Packages were not fully installed.
ru: Пакеты не были полностью установлены.

source: Packages were not fully removed.
ru: Пакеты не были полностью удалены.

source: Packages were successfully installed!
ru: Пакеты были успешно установлены!

source: Packages were successfully removed.
ru: Пакеты были успешно удалены.

source: Packet Mode?
ru: Пакетный режим?

source: Password
ru: Пароль

source: Password (Again)
ru: Пароль (повтор)

source: Please enter numbers within acceptable ranges for year, month, day of month, hour, and minute.
ru: Пожалуйста, введите числа, входящие в диапазоны года, месяца, дня месяца, часа и минуты.

source: Please enter this machine's hostname and domain name.
ru: Введите имя хоста и домена.

source: Please insert the floppy to be formatted in unit 0 (``drive A:'').
ru: Вставьте дискету для форматирования в устройство 0 (``диск A:'').

source: Please select the language you wish you use.
ru: Пожалуйста, выберите язык, который вы предпочитаете использовать.

source: Please select which interface you would like to configure:
ru: Выберите интерфейс для настройки:

source: Please select which services you would like started at boot time.
ru: Пожалуйста, выберите сервисы, которые необходимо запустить во время загрузки.

source: Please set up at least one subpartition.
ru: Настройте хотя бы один подраздел.

source: Primary DNS Server
ru: Первичный DNS сервер

source: Primary partition #%d was formatted.
ru: Основной раздел #%d был отформатирован.

source: Primary partition #%d was not correctly formatted, and may now be in an inconsistent state. We recommend re-formatting it before proceeding.
ru: Основной раздел #%d не был корректно отформатирован, и может находиться в поврежденном состоянии. Рекомендуется переформатировать его перед дальнейшими действиями.

source: Probe and display detailed information about this system
ru: Получение и вывод детальной информации о системе

source: Re-Initialize Bootblock|Cancel
ru: Переустановить загрузочный блок|Отменить

source: Re-enter the user's password to confirm
ru: Введите пароль еще раз для подтверждения

source: Real Name
ru: Полное имя

source: Really omit?
ru: Действительно пропустить?

source: Reboot
ru: Перезагрузка

source: Reboot this Computer
ru: Перезагрузка компьютера

source: Reboot this computer (e.g. to boot into a newly installed system)
ru: Перезагрузка компьютера (например для загрузки установленной системы)

source: Reboot|Return to Select Disk
ru: Перезагрузка|Возврат к выбору диска

source: Reboot|Return to Select Primary Partition
ru: Перезагрузка|Возврат к выбору основного раздела

source: Remove Packages
ru: Удаление пакетов

source: Remove software packages
ru: Удаление программных пакетов

source: Remove third-party software packages from the installed system
ru: Удаление пакетов сторонних разработчиков из системы

source: Return to Begin Installation
ru: Возврат к началу установки

source: Return to Configure Menu
ru: Возврат в меню настройки

source: Return to Create Subpartitions
ru: Возврат к созданию подразделов

source: Return to Select Disk
ru: Возврат к выбору диска

source: Return to Select Primary Partition
ru: Возврат к выбору основного раздела

source: Return to Utilities Menu
ru: Возврат в меню утилит

source: Return to Welcome Menu
ru: Возврат в главное меню

source: Root password
ru: Пароль root

source: Root password again
ru: Пароль root еще раз

source: Run On-Line Memory Test
ru: Запуск он-лайн теста памяти

source: Running after installation custom routines...
ru: Запуск после установки...

source: Secure Shell Daemon
ru: Даемон Secure Shell (ssh)

source: Select Console Font
ru: Выберите консольный шрифт

source: Select Disk
ru: Выбор диска

source: Select Keyboard Map
ru: Выбор раскладки клавиатуры

source: Select Language
ru: Выбор языка

source: Select Primary Partition
ru: Выбор основного раздела

source: Select Screen Map
ru: Выбор карты экрана

source: Select Services
ru: Выбор сервисов

source: Select Time Zone
ru: Выбор временной зоны

source: Select a Time Zone appropriate to your physical location.
ru: Выберите временную зону, соответствующую вашему местонахождению

source: Select a disk on which to install %s
ru: Выберите диск для установки %s

source: Select a disk to format.
ru: Выбор диска для форматирования.

source: Select a font appropriate to your video monitor and language.
ru: Выберите шрифт, соответствующий вашему монитору и языку.

source: Select a keyboard map appropriate to your keyboard layout.
ru: Выберите раскладку клавиатуры

source: Select a mapping for translating characters as they appear on your video console screen.
ru: Выбор карты для трансляции символов на консоль.

source: Select how much of this disk you want to use for %s. %s
ru: Выберите, какая часть этого диска будет использована под %s. %s

source: Select optional software packages that you want installed on this system. This form lists only the software packages installed on the LiveCD; thousands more are available via the internet once %s is installed.
ru: Выберите опциональные программные пакеты для установки в эту систему. Эта форма содержит только список программных пакетов, установленных на LiveCD; тысячи других доступны через интернет после установки %s.

source: Select the disk containing the installation that you would like to upgrade.
ru: Выбор диска, содержащего установку, которую нужно обновить.

source: Select the disk containing the installation.
ru: Выберите диск, содержащий программу установки.

source: Select the disks on which you wish to install bootblocks.
ru: Выбор диска для установки загрузочного блока.
