Repository: nuclewall/bsdinstaller
Catalog: src/backend/installer/po/*.po
Languages: ru

source: Select the existing primary partition (also known as a `slice' in the BSD tradition) on which to install %s. Note that if you do not have any existing primary partitions on this disk, you must first create some. This installer does not currently have the ability to do this, so you will have to exit and run fdisk (in DOS or *BSD) or parted (in Linux) to do so.
ru: Выберите существующие основной раздел (традиционно в BSD называемый `слайсом') для установки %s. Если на этом диске еще нет основных разделов, их необходимо сначала создать. Программа установки на данный момент не может сделать этого, необходимо выйти из нее и запустить fdisk (в DOS или *BSD) или parted (в Linux).

source: Select the installed software packages that you want removed from this system.
ru: Выберите установленные программные пакеты, которые необходимо удалить из системы.

source: Select the primary partition containing the installation you would like to upgrade.
ru: Выбор основного раздела, содержащего установку, которую нужно обновить.

source: Select the primary partition containing the installation.
ru: Выберите основной раздел, содержащий установку.

source: Select this to use 'packet mode' to boot the disk
ru: Выберите этот пункт для использования 'пакетного режима' загрузки диска

source: Select timezone
ru: Выбор временной зоны

source: Set Hostname/Domain
ru: Установка имени хоста/домена

source: Set Root Password
ru: Установите пароль root

source: Set Time/Date
ru: Установка времени/даты

source: Set console font
ru: Выбор шрифта для консоли

source: Set date and time
ru: Установка даты и времени

source: Set how characters are translated before console display
ru: Выбор трансляции символов перед отображением на экран

source: Set how the characters on your video console look
ru: Выбор шрифта для консоли

source: Set keyboard map
ru: Выбор раскладки клавиатуры

source: Set root password
ru: Установка пароля root

source: Set screen map
ru: Выбор соответствия шрифта и кодировки экрана

source: Set the Time Zone of your physical location
ru: Выбор временной зоны, где вы находитесь

source: Set the Time and Date of your machine
ru: Установка даты и времени на компьютере

source: Set the password that the root (superuser) account will use
ru: Установка пароля для root (суперпользователя)

source: Set up network interfaces (NICs, ethernet, TCP/IP, etc)
ru: Настройка сетевых интерфейсов (NIC, ethernet, TCP/IP и т.д.)

source: Set up the subpartitions (also known as just `partitions' in BSD tradition) you want to have on this primary partition. For Capacity, use 'M' to indicate megabytes, 'G' to indicate gigabytes, or a single '*' to indicate 'use the remaining space on the primary partition'.
ru: Установка подразделов (называемых просто `разделами' по традиции BSD), которые будут находиться на этом основном разделе. Для размера используйте 'M', чтобы обозначить мегабайты, 'G', чтобы обозначить гигабайты, или символ '*', чтобы использовать остаток места на основном разделе.

source: Set what kind of keyboard layout you have
ru: Выберите раскладку вашей клавиатуры

source: Setting password...
ru: Установка пароля

source: Setup NetBoot Install Services
ru: Настройка сервисов установки NetBoot

source: Setup NetBoot Installation Environment
ru: Настроить NetBoot среду установки

source: Setup machine as remote installation server
ru: Настроить компьютер как удаленный сервер установки

source: Shell
ru: Оболочка

source: Skip this Step
ru: Пропуск этого действия

source: Some errors occurred. Boot sector was not successfully initialized.
ru: Возникли ошибки. Загрузочный сектор не был успешно инициализирован.

source: Some errors occurred. Start of disk was not successfully wiped.
ru: Возникли ошибки. Начало диска не было успешно очищено.

source: Some errors occurred. Start of primary partition was not successfully wiped.
ru: Возникли ошибки. Начало первичного раздела не было очищено.

source: Some situations in which you might not wish to use this installer are: - you want to install %s onto a logical/extended partition; - you want to install %s onto a ``dangerously dedicated'' disk; or - you want full and utter control over the install process.
ru: В некоторых ситуациях вы не можете использовать эту программу: - установка %s в логический/расширенный раздел; - установка %s на ``dangerously dedicated'' диск; или - необходим тотальный контроль над процессом установки.

source: Some subpartitions on the primary partition of this disk are already activated as swap. Since there is no way to deactivate swap in %s once it is activated, in order to edit the subpartition layout of this primary partition, you must first reboot.
ru: Некоторые подразделы на основном разделе этого диска уже были активированы для подкачки. Поскольку в %s нет способа деактивировать подкачку, для редактирования раскладки подразделов этого основного раздела необходимо сначала перегрузиться.

source: Some subpartitions on the selected primary partition are already activated as swap. Since there is no way to deactivate swap in %s once it is activated, in order to edit the subpartition layout of this primary partition, you must first reboot.
ru: Некоторые подразделы на выбранном основном разделе уже были активированы для подкачки. Поскольку в %s нет способа деактивировать подкачку, для редактирования раскладки подразделов этого основного раздела необходимо сначала перегрузиться.

source: Start of disk was successfully wiped.
ru: Начало диска было успешно очищено.

source: Start of primary partition was successfully wiped.
ru: Начало первичного раздела было успешно очищено.

source: Subpartitions further divide a primary partition for use with %s. Some reasons you may want a set of subpartitions are: - you want to restrict how much data can be written to certain parts of the primary partition, to quell denial-of-service attacks; and - you want to speed up access to data on the disk.
ru: Подразделы это дальнейшее разделение основного раздела для использования с %s. Причины, по которым могут потребоваться подразделы: - вы хотите ограничить объем данных, которые могут быть записаны на определенные части основного раздела для остановки DoS атаки; и - вы хотите повысить скорость доступа к данным.

source: Swap already active
ru: Подкачка уже включена

source: Switch to Expert Mode
ru: Переключиться в экспертный режим

source: Switch to Normal Mode
ru: Переключиться в нормальный режим

source: System Diagnostics
ru: Диагностика системы

source: System Logging Daemon
ru: Даемон системного протоколирования

source: System Startup Messages (dmesg)
ru: Загрузочные сообщения системы (dmesg)

source: Target system could not be mounted.
ru: Целевая система не может быть смонтирована.

source: Test the memory in the machine while running
ru: Запуск тестирования памяти в работающей системе

source: Thank you for choosing %s. For up-to-date news and information on %s, make sure to check out %s You can use this automated application to assist you in setting up this %s system.
ru: Спасибо за выбор %s. Последние новости и самая свежая информация по %s, находятся на сайте %s Вы можете использовать эту программу для настройки установленной системы %s.

source: The Time Zone has been set to %s.
ru: Временная зона была установлена в %s.

source: The date and time have been set.
ru: Дата и время были установлены

source: The disk %s was formatted.
ru: Диск %s был отформатирован.

source: The disk %s was not correctly formatted, and may now be in an inconsistent state. We recommend re-formatting it before attempting to install %s on it.
ru: Диск %s не был правильно отформатирован, и может быть поврежден. Рекомендуется переформатировать его перед установкой %s.

source: The disk on which you wish to install a bootblock
ru: Диск, на который будет установлен загрузочный блок

source: The installer could not find any disks suitable for installation (IDE or SCSI) attached to this computer. If you wish to install %s on an unorthodox storage device, you will have to exit to a LiveCD command prompt and install it manually, using the file /README as a guide.
ru: Программа установки не может найти на этом компьютере диски, подходящие для установки (IDE или SCSI). Если вы хотите установить %s на другое устройство, необходимо выйти в приглашение командной строки LiveCD и провести установку вручную, используя файл /README в качестве руководства.

source: The options on this menu allow you to configure a %s system after it has already been installed.
ru: Это меню позволяет настроить систему %s после ее установки.

source: The passwords do not match.
ru: Пароли не совпадают

source: The root password has been changed.
ru: Пароль root был изменен

source: The same mount point cannot be specified for two different subpartitions.
ru: Одна и та же точка монтирования не может быть задана для разных подразделов.

source: The sole primary partition of the disk %s was not correctly formatted, and may now be in an inconsistent state. We recommend re-formatting the disk before attempting to install %s on it.
ru: Первичный раздел диска %s не был правильно отформатирован, и может быть поврежден. Рекомендуется переформатировать диск перед установкой %s.

source: The space allocated to all of your selected subpartitions (%dM) exceeds the total capacity of the selected primary partition (%dM). Remove some subpartitions or choose a smaller size for them and try again.
ru: Размер, выделенный всем выбранным разделам (%dM), превышает общий размер выбранного основного раздела (%dM). Удалите некоторые подразделы или выберите для них меньший размер и попробуйте еще раз.

source: The subpartitions you chose were not correctly created, and the primary partition may now be in an inconsistent state. We recommend re-formatting it before proceeding.
ru: Выбранный подраздел не был корректно создан, и основной раздел может быть поврежден. Мы рекомендуем переформатировать его перед дальнейшими действиями.

source: The system has issued a cvsup command in the background. Please tail /tmp/cvsupdate.log if you wish to follow the progress.
ru: Система выполнила команду cvsup в фоновом режиме. Используйте tail /tmp/cvsupdate.log для отслеживания текущего выполнения.

source: These functions can help you diagnose this system.
ru: Эти функции могут помочь в диагностике системы

source: These functions let you manipulate the storage devices attached to this computer.
ru: Эти функции предназначены для работы с устройствами хранения, подключенными к компьютеру.

source: This experimental application will install %s on one of the hard disk drives attached to this computer. It has been designed to make it easy to install %s in the typical case. If you have special requirements that are not addressed by this installer, or if you have problems using it, you are welcome to install %s manually. To do so select Exit to Live CD, login as root, and follow the instructions given in the file /README . NOTE! As with any installation process, YOU ARE STRONGLY ENCOURAGED TO BACK UP ANY IMPORTANT DATA ON THIS COMPUTER BEFORE PROCEEDING!
ru: Эта экспериментальная программа установит %s на один из подключенных к компьютеру жестких дисков. Она была разработана для упрощения типичной установки %s. Если вы предъявляете к установке особые требования, не удовлетворяемые этой программой, или у вас проблемы с ее использованием, установите %s вручную. Для этого выйдите из Live CD, войдите под root, и следуйте инструкциям в файле /README . ВНИМАНИЕ! Как и с любым процессом установки, НАСТОЯТЕЛЬНО РЕКОМЕНДУЕТСЯ СДЕЛАТЬ РЕЗЕРВНУЮ КОПИЮ ВСЕХ ВАЖНЫХ ДАННЫХ ПЕРЕД НАЧАЛОМ УСТАНОВКИ!

source: This machine is about to be shut down. After the machine has reached its shutdown state, you may remove the CD from the CD-ROM drive tray and press Enter to reboot from the HDD.
ru: Компьютер будет перезагружен. После завершения работы системы вы можете извлечь компакт-диск из привода и нажать Enter для загрузки с жесткого диска.

source: Upgrade
ru: Обновление

source: Upgrade a FreeBSD 4.X system to %s
ru: Обновление системы FreeBSD 4.X до %s

source: Usage: %s [-o rootdir] [-r rendezvous] [-t caps|npipe|tcp]
ru: Использование: %s [-o rootdir] [-r rendezvous] [-t caps|npipe|tcp]

source: Use DHCP?
ru: Использовать DHCP?

source: Use DHCP|Configure Manually
ru: Использовать DHCP|Настроить вручную

source: Use Entire Disk|Use Part of Disk|Return to Select Disk
ru: Использовать весь диск|Использовать часть диска|Возврат к выбору диска

source: User ID
ru: ID пользователя

source: User `%s' was added.
ru: Пользователь `%s' был добавлен

source: User was not successfully added.
ru: Пользователь не был добавлен

source: Username
ru: Имя пользователя

source: Utilities
ru: Утилиты

source: Utilities to work with and diagnose disks and other subsystems
ru: Утилиты для диагностирования и работы с дисками и другими подсистемами

source: Utilities to work with disks, diagnostics, and the LiveCD Environment
ru: Утилиты для работы с дисками, диагностики и настройки окружения LiveCD

source: Video font not successfully set.
ru: Шрифт не был установлен.

source: WARNING! ALL data in ALL partitions on the disk %s will be IRREVOCABLY ERASED! Are you ABSOLUTELY SURE you wish to take this action? This is your LAST CHANCE to cancel!
ru: ВНИМАНИЕ! ВСЕ данные во ВСЕХ разделах диска %s будут НЕВОССТАНОВИМО УДАЛЕНЫ! Вы АБСОЛЮТНО УВЕРЕНЫ, что хотите выполнить это действие? Это ПОСЛЕДНИЙ ШАНС отменить его!

source: WARNING! ALL data in primary partition #%d, %s on the disk %s will be IRREVOCABLY ERASED! Are you ABSOLUTELY SURE you wish to take this action? This is your LAST CHANCE to cancel!
ru: ВНИМАНИЕ! ВСЕ данные основного раздела #%d, %s на диске %s будут НЕВОССТАНОВИМО УДАЛЕНЫ! Вы АБСОЛЮТНО УВЕРЕНЫ, что хотите выполнить это действие? Это ПОСЛЕДНИЙ ШАНС отменить действие!

source: WARNING: the %s subpartition should be at least %dM in size or you will risk running out of space during the installation.
ru: ПРЕДУПРЕЖДЕНИЕ: размер подраздела %s должен быть как минимум %dM, иначе во время установки места может не хватить.

source: WARNING: you should have a disk at least %dM in size, or you may encounter problems trying to install %s.
ru: ПРЕДУПРЕЖДЕНИЕ: диск должен иметь размер как минимум %dM, или у вас могут возникнуть проблемы при установке %s.

source: WARNING: you should have a primary partition at least %dM in size, or you may encounter problems trying to install %s.
ru: ПРЕДУПРЕЖДЕНИЕ: размер основного раздела должен быть не менее %dM, или при установке %s могут возникнуть проблемы.

source: Warning: Installed system was not properly unmounted.
ru: Предупреждение: установленная система не была правильно размонтирована.

source: Warning: bootblocks were not successfully installed on the disk `%s'. This may be because the disk is new and not yet formatted. If this is the case, it might help to re-initialize the boot sector, then try installing the bootblock again. Note that this should not affect the partition table of the disk.
ru: Предупреждение: загрузочные блоки не были успешно установлены на диск`%s'. Это могло произойти из-за того, что диск новый и еще не был отформатирован. В этом случае может помочь переинициализация загрузочного сектора с последующей повторной установкой загрузочного блока. Обратите внимание, что это не должно повлиять на таблицу разделов диска.

source: Warning: could not assign IP address or default gateway. Write the corresponding settings to rc.conf anyway?
ru: Предупреждение: невозможно назначить IP адрес или шлюз по умолчанию. Записать соответствующие настройки в rc.conf несмотря на это?

source: Warning: could not enable dhclient for %s. Write the corresponding settings to rc.conf anyway?
ru: Предупреждение: невозможно включить dhclient для %s. Записать соответствующие настрйки в rc.conf несмотря на это?

source: Warning: could not launch cvsup
ru: Предупреждение: не удается запустить cvsup

source: Warning: subpartitions were not correctly unmounted.
ru: Предупреждение: подразделы не были правильно отмонтированы.

source: Welcome to %s
ru: Добро пожаловать в %s

source: Welcome to the %s Live CD. %s is an efficient and elegant BSD Unix-derived operating system. For more information, see %s From this CD, you can boot into %s ``live'' (without installing it) to evaluate it, to install it manually, or to troubleshoot problems with an existing installation, using either a command prompt or menu-driven utilities. Also, you can use this automated application to assist you in installing %s on this computer and configuring it once it is installed.
ru: Добро пожаловать в %s Live CD. %s это эффективная и элегантная BSD Unix операционная система. За подробной информацией обратитесь к %s С этого диска вы можете загрузить %s в режиме ``live'' (без установки), чтобы ознакомиться с ней, установить вручную, или решить проблемы с существующей установкой (через приглашение командной строки или через меню утилит. Кроме того, для установки %s вы можете использовать эту программу, а после установки с ее помощью настроить систему.

source: Wipe out the start of a disk
ru: Очистка начала диска

source: Wipe out the start of a primary partition
ru: Очистка начала основного раздела

source: Yes|No
ru: Да|Нет

source: You cannot have more than 16 subpartitions on a single primary partition. Remove some and try again.
ru: На одном основном разделе не может находиться более 16 подразделов. Удалите некоторые подразделы и попробуйте еще раз.

source: You cannot have more than one subpartition with a '*' capacity (meaning 'use the remainder of the primary partition'.)
ru: Вы не можете использовать '*' для обозначения размера более чем одного подраздела (означает 'использовать остаток основного раздела').

source: You have elected to not have the following subpartition(s): %s The ramifications of these subpartition(s) being missing will be: %s Is this really what you want to do?
ru: Вы отказались от создания следующих подразделов: %s Эти подразделы будут заменены так: %s Вы действительно подтверждаете это?

source: You may now wish to install bootblocks on one or more disks. If you already have a boot manager installed, you can skip this step (but you may have to configure your boot manager separately.) If you installed %s on a disk other than your first disk, you will need to put the bootblock on at least your first disk and the %s disk.
ru: Вы можете установить загрузочные блоки на один или несколько дисков. Если менеджер загрузки уже установлен, этот шаг можно пропустить (но менеджер загрузки необходимо настроить отдельно). Если %s устанавливается не на первый диск, загрузочный блок необходимо поместить хотя бы на первый диск и диск с %s.

source: You must enter a username.
ru: Необходимо ввести имя пользователя

source: You must include a / (root) subpartition.
ru: Необходимо включить / (корневой) подраздел.

source: directory name
ru: имя каталога

source: ifconfig Failure
ru: Ошибка ifconfig

source: memtest86 floppy successfully created!
ru: Дискета memtest86 была успешно создана!

source: memtest86 floppy was not successfully created.
ru: Дискета memtest86 не была создана
